# Дополнительное задание
#
# Реализуйте структуру данных «Участники спора».
# Она должна представлять собой список (list) словарей (dict).
# Каждый словарь хранит информацию об отдельном участнике.
# Словарь содержит пары «ключ-значение» параметрами, то есть характеристиками участника:
# наименование, статус, ИНН.
# Заполнение данных должно быть произведено пользователем через консоль для трёх различных участников.

participants = []

for i in range(3):
    print(f"\nВведите данные участника {i + 1}:")
    name = input("Наименование участника: ")
    status = input("Статус участника: ")
    inn = input("ИНН участника: ")

    participant = {"name": name, "status": status, "inn": inn}
    participants.append(participant)


print("\nИтоговый список участников:")
for participant in participants:
    print(participant)